DataProcessors/МониторСверкиСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиСКонтрагентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МониторСверкиСКонтрагентами/Forms/Расшифровка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация         = Параметры.Организация;
	Объект.ДатаНачала          = Параметры.ДатаНачала;
	Объект.ДатаОкончания       = Параметры.ДатаОкончания;
	Контрагент                 = Параметры.Контрагент;
	ИдентификаторРасшифровки   = Параметры.ИдентификаторРасшифровки;
	
	Параметры.Свойство("Поставщики", Поставщики);
	Параметры.Свойство("Покупатели", Покупатели);
	Параметры.Свойство("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщиками);
	Параметры.Свойство("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателями);
	Параметры.Свойство("ИдентификаторЭДО", ИдентификаторЭДО);
	
	УстановитьЗаголовок();
	СформироватьРасшифровкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрНачинаетсяС(Область.Имя, "ПерейтиВСервисСверки") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("РежимРасшифровки", Истина);
		ПараметрыОтчета.Вставить("Организация",      Объект.Организация);
		ПараметрыОтчета.Вставить("Контрагент",       Контрагент);
		ПараметрыОтчета.Вставить("НачалоПериода",    Объект.ДатаНачала);
		ПараметрыОтчета.Вставить("КонецПериода",     Объект.ДатаОкончания);
		
		ОткрытьФорму("Отчет.СверкаРасчетовСКонтрагентами.Форма.ФормаОтчета", ПараметрыОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьЗначениеДляОткрытия(Расшифровка, АдресХранилища);
	Если ЗначениеРасшифровки <> Неопределено Тогда
		ПоказатьЗначение(, ЗначениеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовок()
	
	Заголовок = Обработки.МониторСверкиСКонтрагентами.ПолучитьЗаголовокРасшифровки(ИдентификаторРасшифровки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРасшифровки()

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ИдентификаторРасшифровки",   ИдентификаторРасшифровки);
	ПараметрыОтчета.Вставить("Контрагент",                 Контрагент);
	ПараметрыОтчета.Вставить("Организация",                Объект.Организация);
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	ПараметрыОтчета.Вставить("НачалоПериода",              НачалоДня(Объект.ДатаНачала));
	ПараметрыОтчета.Вставить("КонецПериода",               КонецДня(Объект.ДатаОкончания));
	ПараметрыОтчета.Вставить("УникальныйИдентификатор",    УникальныйИдентификатор);
	
	Если ИдентификаторРасшифровки = "РасшифровкаАктыСверки" Тогда
		ПараметрыОтчета.Вставить("Поставщики",                 Поставщики);
		ПараметрыОтчета.Вставить("Покупатели",                 Покупатели);
		ПараметрыОтчета.Вставить("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщиками);
		ПараметрыОтчета.Вставить("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателями);
	КонецЕсли;
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеДляОткрытия(Расшифровка, АдресХранилища)

	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресХранилища);
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
	Если ПоляРасшифровки.Количество() > 0 Тогда
		ЗначениеРасшифровки = ПоляРасшифровки[0].Значение;
		Если ЗначениеРасшифровки = Null
			Или ЗначениеРасшифровки = Неопределено
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Число")
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Строка")
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Булево") Тогда
			Возврат Неопределено;
		Иначе
			Возврат ЗначениеРасшифровки;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьРасшифровкуНаСервере()
	
	ПараметрыОтчета = ПолучитьПараметрыРасшифровки();
	
	РезультатРасшифровки = Обработки.МониторСверкиСКонтрагентами.СформироватьРасшифровку(ПараметрыОтчета);
	
	Результат      = РезультатРасшифровки.Результат;
	АдресХранилища = РезультатРасшифровки.АдресХранилища;
	
КонецПроцедуры

#КонецОбласти
